// მოცემული გაქვთ პიცის ობიექტების მასივი
// Math.random - ით აიღეთ მასივიდან ნებისმიერი პიცა შემთხვევითობის პრინციპით
// გამოიტანეთ კონსოლში: "თქვენი პიცა {პეპერონი} მზადდება"
// 2 წამის მერე გამოიტანეთ კონსოლში: "თქვენი პიცა გზაშია"
// 5 წამის მერე გამოიტანეთ კონსოლში: "თქვენი პიცა ადგილზეა, ფასი - {20} ლარი"
// დროის საკონტროლებლად გამოიყენეთ setTimeout ფუნქცია
// ბონუსი: ბოლოს გამოიტანეთ კონსოლში შეკვეთის ხანგრძლივობა დაწყებიდან დასრულებამდე.
const pizzas = [
    {
        name: "პეპერონი",
        price: 20
    },
    {
        name: "მარგარიტა",
        price: 15
    },
    {
        name: "კომბინირებული",
        price: 22
    }
];

let x = Math.floor(Math.random() * 3);

function a(){
    console.log("თქვენი პიცა" +  pizzas[x].name + "მზადდება");
}
let n = new Date();

function b(){
    console.log("თქვენი პიცა გზაშია");
    setTimeout(c, 5000 );
    
}

function c(){
    console.log("თქვენი პიცა ადგილზეა, ფასი - " + pizzas[x].price + " ლარი")
    let m = new Date ();
    console.log("                             შეკვეთის სრული დროა   " + (m-n)  + "  წამი ");
}



a();


setTimeout (b, 2000);







